// Отрисовка спрайта по его центральным координатам
// Массивы с масками для спрайтов


// Отрисовка спрайта по его центральным координатам
void drawSprite(float xCentre, float yCentre, int[][] sprite) {
  int row = sprite.length;
  int col = sprite[0].length;

  // Конвертация кординат центра спрайта в координаты его верхнего левого ула
  float startPointDrawX = xCentre - col * (widthSpritePixel / 2);
  float startPointDrawY = yCentre - row * (widthSpritePixel / 2);
  float x = startPointDrawX;
  float y = startPointDrawY;

  rectMode(CENTER);
  noStroke();

  // Отрисовка спрайта по координатам левого верхнего улга
  for (int i = 0; i < row; i ++) {
    for (int j = 0; j < col; j ++) {
      if (sprite[i][j] == 1) {
        rect(x, y, widthSpritePixel, widthSpritePixel);
      }
      x = x + widthSpritePixel;
    }
    x = startPointDrawX;
    y = y + widthSpritePixel;
  }

  // После отрисовки возвращаем координаты в левый верхний угол спрайта, 
  // чтобы он не рисовался бесконечно вниз и вправо.
  x = startPointDrawX;
  y = startPointDrawY;
}


// Массивы с масками для спрайтов
// Захватичик Роджер
int[][] roger = {
  {0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0}, 
  {1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 1}, 
  {1, 0, 1, 1, 1, 1, 1, 1, 1, 0, 1}, 
  {1, 1, 1, 0, 1, 1, 1, 0, 1, 1, 1}, 
  {0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0}, 
  {0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0}, 
  {0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0}, 
  {0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0}
};

// Захватичик Ганс
int[][] hans = {
  {0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0}, 
  {0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0}, 
  {1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1}, 
  {1, 1, 1, 0, 0, 1, 1, 0, 0, 1, 1, 1}, 
  {1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1}, 
  {0, 0, 1, 1, 1, 0, 0, 1, 1, 1, 0, 0}, 
  {0, 1, 1, 0, 0, 1, 1, 0, 0, 1, 1, 0}, 
  {0, 0, 1, 1, 0, 0, 0, 0, 1, 1, 0, 0}, 
};

// Пуля захватичика
int[][] invadorLightning = {
  {1, 0, 0}, 
  {0, 1, 0}, 
  {0, 0, 1}, 
  {0, 1, 0}, 
  {1, 0, 0}, 
  {1, 0, 0}, 
  {0, 1, 0}, 
  {0, 0, 1}, 
};

// Корабль освободитель
int[][] ship = {
  {0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0}, 
  {0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0}, 
  {1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1}, 
  {1, 0, 0, 1, 1, 1, 1, 1, 0, 0, 1}, 
  {1, 1, 1, 1, 2, 2, 2, 1, 1, 1, 1}, 
  {1, 0, 0, 1, 1, 1, 1, 1, 0, 0, 1}, 
  {1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 1}, 
  {1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1}, 
  {1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1}, 
};

// Ракета освободителя
int[][] b = {
  {0, 0, 1, 0, 0}, 
  {0, 1, 0, 1, 0}, 
  {0, 1, 1, 1, 0}, 
  {1, 1, 0, 1, 1}
};

// Взрыв спрайта
int[][] spriteExplosion = {
{1, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 1, 0},
{0, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 1, 0},
{0, 0, 1, 0, 1, 1, 0, 0, 1, 1, 1, 1, 1},
{1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1},
{0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0},
{0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0},
{1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0}
};

int[][] bulletExplosion = {
{1, 0, 1, 0, 1},
{0, 1, 0, 1, 0},
{1, 0, 1, 0, 1},
{0, 1, 0, 0, 0},
{1, 0, 1, 0, 1}
};

int[][] bulletToBullet = {
{1, 1, 0, 0, 0, 0, 0, 1, 1},
{0, 1, 1, 0, 0, 0, 1, 1, 0},
{1, 1, 1, 1, 1, 1, 1, 1, 1},
{0, 1, 1, 0, 0, 0, 1, 1, 0},
{1, 1, 0, 0, 0, 0, 0, 1, 1,}
};
